Tekla.Structures.Drawing.Polygon.PolygonAttributes
The PolygonAttributes class is the attributes class of the polygon.

Tekla.Structures.Drawing.Polygon.PolygonAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.Polygon.PolygonAttributes.#ctor
Creates a new default polygon attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Polygon.PolygonAttributes.#ctor(System.String)
Creates a new polygon attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.Polygon.PolygonAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Polygon.PolygonAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.